import React from 'react';
import MainFon from "../Comp/StyleComp/MainFon";

const About = () => {
    return (
        <div className="App">
            <MainFon
                title="Про нас"
                desc="Це сторінка, де ви можете дізнатися інформацію про нас."
            />
            <div className="container">
                <div className="about_content__block">
                    <h1>Мета створення веб-сайту</h1>
                    <p>Головною метою створення цього веб-сайту - є навчитися розробляти веб-сайти за допомогою
                    дуже широко росповсюджених технологій, що називается фреймворком.</p>
                    <p>Сайт створений за допомогою одного з найвідоміших та розповсюджених фреймворків для язика
                    програмування JavaScript - ReactJS.</p>
                    <p>React — відкрита JavaScript бібліотека для створення інтерфейсів користувача,
                        яка покликана вирішувати проблеми часткового оновлення вмісту вебсторінки, з якими стикаються в
                        розробці односторінкових застосунків.
                        Розробляється Meta (раніше Facebook) і спільнотою індивідуальних розробників.</p>
                    <div style={{textAlign:"center", margin: "40px 0"}}>
                        <img width="400" src="/assets/images/React.png"/>
                    </div>
                    <h1>Дипломний проект</h1>
                    <p>Проект(веб-сайт) розроблений, щоб показати навички та не тільки, здобуті
                    у період навчання у колледжі.</p>
                </div>
            </div>
        </div>
    );
};

export default About;